app/views/listings/_form_iphone.html.erb

SELECT "products".* FROM "products" WHERE "products"."type_id" = ?  [["type_id", 1]]
---
  <%= form.label "Product: " %>
  <%= form.collection_select :product_id, Product.where(:type_id => 1), :id, :name  %>