app/views/listings/_form_macbook.html.erb

  <%= form.label "Product: " %>
  <%= form.collection_select :product_id, Product.where(:type_id => 2), :id, :name  %>
---
SELECT "products".* FROM "products" WHERE "products"."type_id" = ?  [["type_id", 2]]