app/views/listings/new_phone.html.erb

  <%= form.label "Product: " %>
  <%= form.collection_select :product_id, Product.all, :id, :name  %>
---
SELECT "products".* FROM "products"