app/views/listings/new_macbook.html.erb

SELECT "products".* FROM "products" WHERE "products"."type_id" = ?  [["type_id", 2]]
---
  <%= form.label "Product: " %>
  <%= form.collection_select :product_id, Product.where(:type_id => 2), :id, :name  %>