app/views/listings/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
<% @listing.comments.each do |comment| %>
    <%= comment.user.first_name %>