app/views/listings/show.html.erb


<h3> Comments (<%= @listing.comments.size %>) </h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."listing_id" = ?  [["listing_id", 7]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."listing_id" = ?  [["listing_id", 1]]

<% @listing.comments.each do |comment| %>
    <%= comment.user.first_name %> posted <%= distance_of_time_in_words(comment.listing.created_at, comment.created_at) %> later at <%= comment.created_at%>
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]