app/views/listings/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."listing_id" = ?  [["listing_id", 7]]
SELECT "comments".* FROM "comments" WHERE "comments"."listing_id" = ?  [["listing_id", 7]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    <div class="col my-auto">
        <h2>Comments (<%= @listing.comments.size %>) </h2>

        <% @listing.comments.each do |comment| %>
            <h5> <%= comment.user.first_name %> <%= comment.display_timestamp %> </h5>