app/views/users/show.html.erb

<h4>Likes: <%= @user.display_likes %> </h4>
<h4>Total Exchanges: <%= @user.exchanges.size + @user.inactive_listings.size  %> </h4>
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = ?  [["user_id", 1]]
SELECT "exchanges".* FROM "exchanges" WHERE "exchanges"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "exchanges" WHERE "exchanges"."user_id" = ?  [["user_id", 2]]

<h2>My Purchases:</h2>
<% @user.exchanges.each do |exchange| %>
---
SELECT "exchanges".* FROM "exchanges" WHERE "exchanges"."user_id" = ?  [["user_id", 2]]