app/controllers/comments_controller.rb

INSERT INTO "comments" ("listing_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["listing_id", 7], ["user_id", 2], ["content", "brooo"], ["created_at", "2019-09-13 17:13:14.113352"], ["updated_at", "2019-09-13 17:13:14.113352"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.listing_id = params[:listing_id]

        @comment.save