app/controllers/exchanges_controller.rb

    def create
        @exchange = Exchange.create(exchange_params)
        @exchange.buy
        @exchange.sell
        @exchange.listing.toggle(:active).save!
        @exchange.save
---
INSERT INTO "exchanges" ("listing_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["listing_id", 1], ["user_id", 1], ["created_at", "2019-09-10 22:08:04.499028"], ["updated_at", "2019-09-10 22:08:04.499028"]]
INSERT INTO "exchanges" ("listing_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["listing_id", 7], ["user_id", 2], ["created_at", "2019-09-13 19:27:51.931822"], ["updated_at", "2019-09-13 19:27:51.931822"]]
UPDATE "listings" SET "updated_at" = ?, "active" = ? WHERE "listings"."id" = ?  [["updated_at", "2019-09-10 23:22:32.693130"], ["active", 0], ["id", 1]]
UPDATE "listings" SET "active" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["active", 0], ["updated_at", "2019-09-13 19:27:51.946890"], ["id", 7]]

    def show
        @exchange = Exchange.find(params[:id])
---
SELECT "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def add_like
        @exchange = Exchange.find(params[:id])

        @buyer = @exchange.user
        @seller = @exchange.listing.user

        if current_user.id == @seller.id
            @buyer.likes += 1
            @buyer.save
        else
            @seller.likes += 1
            @seller.save
---
SELECT "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "likes" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["likes", 1], ["updated_at", "2019-09-12 21:42:32.846449"], ["id", 4]]