app/controllers/listings_controller.rb

    def create
        @listing = Listing.create(listing_params)
---
INSERT INTO "listings" ("user_id", "product_id", "condition", "color", "storage", "memory", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def edit_iphone
        @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        @listing = Listing.find(params[:id])
        @listing.update(listing_params)
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "listings" SET "price" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["price", 700.0], ["updated_at", "2019-09-11 20:47:40.772263"], ["id", 2]]