app/controllers/reviews_controller.rb

    def create
        @product = Product.find(params[:id])
        @review = Review.create(review_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("product_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 2], ["user_id", 2], ["content", "Very nice!"], ["created_at", "2019-09-13 19:27:03.203230"], ["updated_at", "2019-09-13 19:27:03.203230"]]