app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "likes", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
      @user = User.find_by(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def add
      @user = User.find_by(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["balance", 1500.0], ["updated_at", "2019-09-13 13:35:31.220668"], ["id", 8]]
---
    def add_money
      @user = User.find_by(id: session[:user_id])

      if !params[:user][:amount].empty?
        @user.balance += params[:user][:amount].to_f
        @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def edit
      @user = User.find_by(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
    def update
      @user = User.find_by(id: session[:user_id])
      @user.update(user_params)