app/models/exchange.rb

UPDATE "users" SET "balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["balance", 800.0], ["updated_at", "2019-09-10 23:22:32.672164"], ["id", 2]]
---
    def buy
        self.user.balance = self.user.balance - self.listing.price
        self.user.save

UPDATE "users" SET "balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["balance", 1300.0], ["updated_at", "2019-09-10 23:30:05.223727"], ["id", 1]]
---
    def sell
        self.listing.user.balance = self.listing.user.balance + self.listing.price
        self.listing.user.save