app/models/product.rb

    def active_listings
        self.listings.select {|listing| listing.active == true}
---
SELECT "listings".* FROM "listings" WHERE "listings"."product_id" = ?  [["product_id", 1]]