app/models/user.rb

SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = ?  [["user_id", 4]]
---
    def active_listings
        self.listings.select {|listing| listing.active == true}

SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = ?  [["user_id", 4]]
---
    def inactive_listings
        self.listings.select {|listing| listing.active == false}

SELECT "exchanges".* FROM "exchanges" WHERE "exchanges"."listing_id" = ? LIMIT ?  [["listing_id", 3], ["LIMIT", 1]]
---
    def sales
        self.inactive_listings.map {|listing| listing.exchange}

SELECT COUNT(*) FROM "exchanges" WHERE "exchanges"."user_id" = ?  [["user_id", 4]]
---
    def display_likes
        current_likes = self.likes
        myexchanges = self.exchanges.size + self.inactive_listings.size

SELECT COUNT(*) FROM "exchanges" WHERE "exchanges"."user_id" = ?  [["user_id", 2]]
---
    def approval_rating
        mylikes = self.display_likes.to_f
        myexchanges = self.exchanges.size.to_f + self.inactive_listings.size.to_f