app/views/products/show.html.erb

SELECT "listings".* FROM "listings" WHERE "listings"."product_id" = ?  [["product_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
            <h2>All Listings:</h2>
                <% @product.active_listings.each do |listing| %>
                <%= link_to "Condition: #{listing.condition} - Color: #{listing.color} - Storage: #{listing.storage} - Memory: #{listing.memory} - Price: $#{number_with_precision(listing.price, precision: 2)} - Seller: #{listing.user.first_name}(#{listing.user.approval_rating})", listing_path(listing)%> <br>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <div class="col my-auto">
        <h2>Reviews (<%= @product.reviews.size %>) </h2>

        <% @product.reviews.each do |review| %>
            <%= review.user.first_name %> <%= review.display_timestamp %>