app/views/products/show.html.erb


<h2>Reviews (<%= @product.reviews.size %>) </h2>

<% @product.reviews.each do |review| %>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]